Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་ན་རྒྱུ་དེ་འགགས་ན་སེམས་ཀྱང་འགག་པས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་སྦྱངས་པའི་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་འཇུག་པར་བྱེད་དེ། དེ་འགོག་པས་ཉིན་ཞག་གཅིག་འདའ་བར་བྱེད་དོ། །
en: In that way, since its causes have ceased, the mind will also cease, and they will enter the absorption of cessation in which physical, verbal, and mental formations are utterly purified.

source: ཇི་ལྟར་བསམས་པ་བཞིན་འགོག་པ་ལ་སྙོམས་པར་འཇུག་པས་མཚུངས་པ་དེ་མ་ཐག་པའི་སེམས་དང་པོ་ལྡང་བའི་བར་དུ་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོའི་བར་ཡང་འདའ་བར་བྱེད་དོ།
en: They will spend either one day within that cessation, or, if they prefer, many hundreds of thousands of eons will pass before the first instant of mind arises, immediately after the absorption of cessation.

source: །སེམས་གཉིས་པས་ནི་དེའི་ཟག་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པ་དང་། ཚེ་ཡང་ཡོངས་སུ་ཟད་པར་འགྱུར་བས་མགོ་མཉམ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བྱེད་དེ།
en: Within the second instant of mind, all their defilements and lives will be exhausted, and they will simultaneously pass into parinirvāṇa.

source: འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པ་ཟག་པ་མེད་པའི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་དོན་ཡིན་ནོ།
en: This is the meaning of the dhāraṇī mantra that accords with the undefiled truth unshared by ordinary beings.

source: །དེ་ལ་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་དང་། སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པའི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་དོན་གང་ཞེ་ན།
en: “What is the meaning of the dhāraṇī mantra that accords with the truth both shared and unshared by ordinary beings?

source: འདི་ལྟར་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གཟུགས་ཇི་ལྟ་བུར་རྣམ་པར་བརྟགས་པ་དེ་ལྟ་བུ་ཁོ་ནར་མཐོང་ངོ་།
en: Some will think, ‘Forms are only perceived in the way they are imagined.

source: །སེམས་ནི་སེམས་ཉིད་དང་གཟུགས་ཉིད་ཡིན་ཏེ། དེའི་ཕྱིར་བདག་གིས་ནམ་མཁའ་དག་པ་ཉིད་ལ་བརྟག་པར་མི་བྱའོ་སྙམ་མོ། །དེ་གཟུགས་ཐམས་ཅད་སྤང་བར་འདོད་དེ། དེ་ལྟར་དེའི་གཟུགས་ཀྱི་འདུ་ཤེས་ཐམས་ཅད་སྤངས་ནས་དེ་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དུ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: The mind is both the mind and forms, so I should not imagine pure space.’ Wishing to abandon all forms, they will abandon all their perceptions of forms, and they will then perfect and dwell within the sphere of infinite space while thinking, ‘This is infinite space!’ This is the absorption that is shared by ordinary beings.

source: །གང་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་གཟུགས་ནི་ནམ་མཁའ་སྟེ། བདག་གིས་ནམ་མཁའ་གཟུགས་སུ་མཐོང་ངོ་།
en: “Some will then think, ‘My physical form is space—I see space as physical form.

source: །ནམ་མཁའི་མཚན་ཉིད་ཅི་ཞེ་ན།
en: What is the defining characteristic of space?

source: ནམ་མཁའ་ནི་གོ་འབྱེད་པའི་མཚན་ཉིད་དོ།
en: The defining characteristic of space is that it accommodates.

source: །འོན་ཀྱང་ནམ་མཁའ་ནི་རླུང་གིས་ཁྱབ་པའོ། །རླུང་དེ་ཡང་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པའོ།
en: However, space is pervaded by the winds, and the winds arise from the four great elements.

source: །བདག་གི་གཟུགས་ཀྱང་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ་ཡིན་ཏེ། གཉི་ག་མཚན་ཉིད་མཚུངས་སོ་སྙམ་མོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅི་འབྱུང་བ་རྣམས་འབྱུང་བ་ཆེན་པོའི་ངོ་བོ་དག་ཡིན་ནམ་སྙམ་ཞིང་། དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: My physical form is also made of the four great elements, since both have the same defining characteristics.’ They will wonder, ‘Does everything that arises have the essence of the great elements?’ They then think,

source: གཉི་ག་སྤྱིའི་མཚན་ཉིད་དུ་འབྱུང་བ་དག་མ་ཡིན་ནོ་སྙམ་མོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: ‘Neither of these arise with general characteristics.’ Why is that?

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Because all phenomena are intrinsically empty.

source: །དེ་བཞིན་དུ་རང་གི་ངོ་བོ་ཡང་གཞན་གྱི་དངོས་པོས་སྟོང་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། གཞི་མེད་པ་ཡིན་ནོ། །དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་དེ་བཞིན་གཤེགས་པ་ཡིད་ལ་འབྱུང་ངོ་། །དེས་ནམ་མཁའ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་གཅིག་མཐོང་ངོ་།
en: Similarly, one’s own essence is also empty of any other entity—it is unborn, unceasing, unarisen, and groundless.’ When they investigate in that way, the thus-gone ones will manifest in their minds, and those beings will see nothing but the thus-gone ones throughout all of space.

source: །དེས་དེ་ལྟར་མཐོང་བས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འཐོབ་བོ།
en: Perceiving the thus-gone ones in that way, they will attain the fruition of the non-returners.

source: །འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་དང་པོའོ། །
en: This is the first sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: གཞན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་འདིས་གནས་པ་དེ་ཅི་རང་གི་ངོ་བོའི་མཚན་ཉིད་ཡིན་ནམ། འོན་ཏེ་དེ་ཉིད་ནམ་མཁའ་ཡིན་སྙམ་ཞིང་། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ནམ་མཁའི་མཚན་ཉིད་དག་པ་ནི་བདག་གི་བདག་ཡིན་གྱི། བདག་གི་ངོ་བོའི་མཚན་ཉིད་ནི་མ་ཡིན་ནོ་སྙམ་ནས་དེ་ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་ཇི་སྙེད་ཡིད་ལ་བྱེད་པ་དེ་སྙེད་ཀྱིས་བདག་ཡང་དག་པར་ཤེས་ཏེ།
en: “Again, some will wonder, ‘Is abiding by this sphere of infinite space the defining characteristic of my own essence, or is it space?’ They will then think, ‘The pure defining characteristic of space is my own identity, but it is not the defining characteristic of my own essence.’ Thinking in that way, the more they contemplate limitless, infinite space, the more they will cognize their identity.

source: འདི་ནི་དེའི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the absorption that is shared by ordinary beings.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ནམ་མཁའ་ཐམས་ཅད་ནི་བདག་གི་བདག་ཡིན་ན། འོ་ན་ཅི་ནམ་མཁའ་ལ་ངོ་བོ་གཞན་ཡོད་དམ།
en: “Some will then wonder, ‘If all of space is my identity, does space have other essences?

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཡིད་ལ་བྱེད་པ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཇི་ལྟར་བསྟན་སྙམ་མོ། །དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཡིད་ལ་བྱེད་པ་དེ་སྙེད་ཡང་དག་པར་རྗེས་སུ་མཐོང་ཞིང་།
en: When I focus my attention on the thus-gone ones, how do they manifest?’ The more they contemplate the thus-gone ones, the more they will perceive them.

source: མཐོང་བ་ཙམ་གྱི་མོད་ལ་ཁ་ཅིག་འབྲས་བུ་དང་པོ་དེ་ལ་གནས་པར་བྱེད་ཅེས་བྱ་བ་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པའི་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་མངོན་དུ་བྱེད་དེ།
en: As soon as they see them, some will settle within the first fruition, and some will actualize the other fruitions up to the level of the worthy ones who have abandoned all afflictions.

source: འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་གཉིས་པའོ། །
en: This is the second sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ནམ་མཁའ་དག་པ་རབ་ཏུ་དང་བ་རྙོག་པ་མེད་པ་བདག་གི་བདག་ཇི་སྙེད་པ། ཅི་བདག་གི་དགེ་བའི་སེམས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ་གཞི་མེད་པ་ཡིན་ནམ་སྙམ་མོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སྣང་བ་ཆེན་པོ་བྱེད་པ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དེ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བའོ་སྙམ་མོ། །དེ་ཇི་ལྟར་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡིད་ལ་བྱེད་པ་བཞིན་སྐད་ཅིག་དེ་ཉིད་ལ་ཁ་ཅིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གནས་པར་བྱེད་ཅེས་བྱ་བ་ནས་ཁ་ཅིག་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་མངོན་དུ་བྱེད་དེ།
en: “Again, some will wonder, ‘Is my own identity, which is thoroughly pure, pristine, unsullied space, also my virtuous mind, which is groundless and devoid of all afflictions?’ They will then think, ‘The eightfold path of the noble ones, which generates great illumination, is free of all afflictions.’ The moment they contemplate the eightfold path of the noble ones that is free of all afflictions, some will settle within the fruition of the stream enterers, and some will actualize the other fruitions up to the level of the worthy ones.

source: འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་གསུམ་པའོ།
en: This is the third sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: །གཞན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་བདག་གི་རྟོག་པ་རྣམས་ནི་དོན་མེད་པ་སྒྲུབ་པ་ཡིན་ཏེ།
en: “Again, some will think, ‘What my concepts bring about is meaningless.

source: གང་བདག་གིས་གཟུགས་ལ་རྣམ་པར་བརྟག་པས་གནས་པར་མི་བྱའོ།
en: I should not keep on imagining forms.

source: །གང་ན་གཟུགས་ཡོད་པ་དེ་ན་འདུ་ཤེས་ཐ་དད་པ་ཡོད་དོ། །དེ་ན་ཐོགས་པའི་འདུ་ཤེས་ཡོད་དོ།
en: Where there are forms, there are distinct perceptions that are impediments, and there is old age and death.

source: །དེ་ན་རྒ་ཤི་ཡོད་པས་བདག་གིས་རྒ་ཤི་རྣམ་པར་གཅད་པའི་ཕྱིར་སེམས་སྒོམ་མོ།
en: I will therefore train to bring an end to old age and death.

source: །ནམ་མཁའི་འདུ་ཤེས་སུ་ཡང་མོས་སོ་སྙམ་མོ། །ཡང་དེ་ནམ་མཁའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་ཅིང་དེ་ཡང་དག་པར་ཤེས་པར་བྱེད་ལ། དེ་ལ་རབ་ཏུ་སྦྱོར་བར་བྱེད། དེ་ལ་མོས་པར་བྱེད་དེ།
en: I will focus on the perception of space!’ Again, they will contemplate, cognize, envisage, and visualize the perception of space.

source: དེ་ནམ་མཁའ་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཇི་སྙེད་པ་ཐམས་ཅད་ལ་བདག་ཉིད་ཀྱིས་མངོན་པར་བརྗོད་པ་དང་མོས་པར་བྱེད་ཅིང་རྫོགས་པར་བྱས་ཏེ་གནས་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཡིན་ཏེ།
en: In all possible ways, they will verbalize, visualize, perfect, and dwell within utterly pure space. This is the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བའོ།
en: It is shared with ordinary beings.

source: །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ནི་བདག་གི་བདག་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཡིན་ཏེ། དེ་ནམ་མཁའ་ཐམས་ཅད་ལ་ད་དུང་བདག་གི་རྟོག་པ་རྣམས་ཀུན་ཏུ་སྤྱོད་པར་བྱེད་དོ། །གང་བདག་གི་བདག་གིས་ནམ་མཁའ་ལ་བརྟག་པར་བྱའོ།
en: “Again, some will think, ‘This is my pure identity, yet my concepts are still applied to all of space.

source: །བདག་གི་འདུ་ཤེས་ནི་ནམ་མཁའ་ཡིན་ནོ་སྙམ་མོ། །འོན་ཀྱང་འདུ་ཤེས་ཐམས་ཅད་ནི་སྡུག་བསྔལ་གྱི་སྒྲར་གསུངས་ཏེ། འདི་ནི་ཀུན་འབྱུང་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱི་འགོག་པ་དང་ཞི་བ་ཡིན་ཏེ།
en: I must consider space in terms of my identity! My perception is space.’ Nevertheless, all perceptions are said to be the sound of suffering, so this is not the cessation and pacification of the entirety of suffering and its origin.

source: སུས་དེ་ལ་སྡུག་བསྔལ་བ་དང་ཀུན་འབྱུང་བ་འགོག་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེའི་དུས་ན་ཁ་ཅིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གནས་པ་ནས་ཁ་ཅིག་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ལ་གནས་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་བཞི་པའོ།
en: As they perceive this as the cessation of suffering and its origin, some will settle within the fruition of the stream enterers, and some will settle within the other fruitions up to the level of the worthy ones. This is the fourth sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འོ་ན་ནམ་མཁའ་བསྒོམ་པར་བྱ་བའི་ཕྱིར་ལན་མང་དུ་གནས་པར་བྱའོ།
en: “Again, some will think, ‘In order to cultivate space, I must dwell on it repeatedly.

source: །གང་ནམ་མཁའ་ཐམས་ཅད་ནི་བདག་གི་བདག་ཡིན་ཏེ།
en: All of space is my identity.

source: ནམ་མཁའ་ལ་མོས་པར་བྱའོ།
en: I must apply myself to space.

source: །རྣམ་པར་ཤེས་པ་ཡོངས་སུ་བཙལ་བར་བྱའོ་སྙམ་ནས་ནམ་མཁའ་ཇི་ཙམ་པར་དེའི་རྣམ་པར་ཤེས་པ་མཉམ་པར་སྣང་ངོ་།
en: I must investigate consciousness!’ Thinking in that way, their consciousnesses will manifest in the same manner as space.

source: །དེའི་ནམ་མཁའི་འདུ་ཤེས་ཀྱང་སྤངས་ཤིང་ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ཀུན་ཏུ་སྣང་སྟེ།
en: They will abandon their perceptions of space, and their consciousnesses will manifest in the same manner as infinite, limitless space.

source: །འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་སོ།
en: This is the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: །དེ་ལ་གནས་པ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་འདི་ནི་རྟོག་པ་དང་།
en: “Those who abide by this will think, ‘This perception of my consciousness is a concept;

source: སྡུག་བསྔལ་བ་དང་། ཀུན་འབྱུང་བ་ཞེས་བྱ་བ་ནས་དེ་ཉིད་རྣམ་པར་ཤེས་པ་ཕྱིན་ཅི་ལོག་གི་བར་ཡིན་ནོ་སྙམ་མོ།
en: it is suffering and its origin, and it is a mistaken consciousness.

source: །འོན་ཀྱང་བདག་གི་ཕྱིན་ཅི་ལོག་འདི་ནི་དགག་པར་བྱའོ། །གནས་སྐབས་གང་དུ་སྡུག་བསྔལ་ཞེས་བྱ་བ་ནས་འགོག་པའི་བར་དུ་ཡིད་ལ་བྱེད་པའི་གནས་སྐབས་དེ་ན་ཁ་ཅིག་འབྲས་བུ་དང་པོ་ལ་གནས་སོ་ཞེས་བྱ་བ་ནས་ཁ་ཅིག་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ལ་གནས་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་ལྔ་པའོ། །
en: Nevertheless, my mistake must be interrupted.’ At the occasion of contemplating suffering up to its cessation, some will settle within the first fruition, and others will settle within the other fruitions up to level of the worthy ones. This is the fifth sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་འདི་ནི་རྟོག་པ་དང་། ཟུག་རྔུ་དང་། འབྲས་དང་། ནད་ཉིད་ཡིན་ཏེ།
en: “Again, some will think, ‘My perceptions of consciousness are concepts; they are like pains, boils,” and a disease.

source: གང་བདག་གིས་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་དེ་ཡང་སྤང་བར་བྱ་གོར་མ་ཆག་གོ་སྙམ་ནས་ནམ་མཁའི་འདུ་ཤེས་དེ་ཡང་སྤངས་ཤིང་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ཀྱང་སྤོང་བར་བྱེད་དོ། །དེ་ཅི་ལ་ཡང་དམིགས་པར་མི་བྱེད་དོ།
en: I must also surely abandon my perceptions of consciousness!’ Thinking in that way, they will abandon the perception of space as well as the perception of consciousness, and they will not apprehend anything whatsoever.

source: །དེའི་ཚེ་འདུ་ཤེས་མེད་པ་ལ་སྙོམས་པར་ཞུགས་པ་ཡིན་ཏེ་སུ་ལ་སྔར་འདི་བྱུང་བ་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: At that moment, they will enter the absorption of the absence of perception. Those in whom this has occurred in the past have reached the absorption that is shared by ordinary beings.

source: །དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པ་ནི་ཟུག་རྔུ་དང་། འབྲས་དང་། ནད་རྣམས་ཡིན་ཏེ།
en: Similarly, they will think, ‘Consciousness is a pain, a boil, and a disease.

source: གང་བདག་གིས་མེད་པ་ཉིད་ཡིད་ལ་བྱ་གོར་མ་ཆག་སྙམ་མོ། །ཅི་ཞིག་མེད་ཅེ་ན།
en: I must surely focus my attention on nonexistence!’ What kind of nonexistence?

source: འདུ་ཤེས་ཐམས་ཅད་བདག་གམ་བདག་གི་མེད་དོ།
en: All perceptions are devoid of I and mine.

source: །བདག་དེས་བདག་དང་འདུ་ཤེས་ཀྱང་སྤང་བར་བྱ་སྟེ། དེ་ནི་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ།
en: Through that identity, both identity and perceptions must be abandoned—that is nirvāṇa.

source: །གནས་སྐབས་གང་དུ་མྱ་ངན་ལས་འདས་པ་ཡིད་ལ་བྱས་པའི་གནས་སྐབས་དེར་ཁ་ཅིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གནས་པ་ནས་ཁ་ཅིག་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ལ་གནས་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་དྲུག་པའོ།
en: At the occasion of contemplating nirvāṇa, some will settle within the fruition of the stream enterers, and others will settle within the other fruitions up to the level of the worthy ones. This is the sixth sphere of liberation based on the dhāraṇī mantra that accords with the truth shared by ordinary beings.

source: །ཡང་སུ་ཞིག་འདི་སྙམ་དུ་སེམས་ཏེ། རྣམ་པར་ཤེས་པའི་ཏིང་ངེ་འཛིན་གྱི་རིམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཉོན་མོངས་པ་ཅི་ཡང་མེད་པའི་སེམས་ཀྱིས་གནས་པར་བྱའོ་སྙམ་ནས་དེ་མི་རྟོག་པའི་ཚུལ་གྱིས་ཅི་ཡང་མེད་པའི་སེམས་ཀྱིས་གནས་པར་བྱེད་དེ།
en: “Again, some will think, ‘I must dwell on the pure level of the absorption of consciousness with a mind totally devoid of afflictions!’ Thinking in that way, they will abide with minds totally devoid of concepts.

source: གནས་སྐབས་གང་དུ་མི་རྟག་པའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པའི་གནས་སྐབས་དེར་དེ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱེད་པ་ནས་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་མངོན་དུ་བྱེད་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་བདུན་པའོ།
en: At the occasion of contemplating the perception of impermanence, they will actualize the fruition of the stream enterers and the other fruitions up to the level of the worthy ones. This is the seventh sphere of liberation based on the dhāraṇī mantra of the acceptance that accords with the truth unshared by ordinary beings.

source: །སུ་ཞིག་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་ཤེས་པ་ཡང་དག་པར་སྤངས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་བྱའོ་སྙམ་ནས་དེ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཐམས་ཅད་སྤངས་ཏེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཡིད་ལ་བྱེད་ཅིང་ཡང་དག་པར་མི་ཤེས། རབ་ཏུ་སྦྱོར་བར་མི་བྱེད། བྱིན་གྱིས་རློབ་པར་མི་བྱེད། སྒོམ་པར་མི་བྱེད། སྒྲུབ་པར་མི་བྱེད་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ལས་རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་བརྒྱད་པའོ།
en: “Again, some will think, ‘I must entirely abandon the cognition in which there is nothing whatsoever, and then I must perfect and dwell within the sphere of neither perception nor nonperception!’ Thinking in that way, they will completely abandon the sphere of nothing whatsoever and instead contemplate the sphere of neither perception nor nonperception, without cognizing, envisaging, visualizing, cultivating, or accomplishing it. This is the eighth sphere of liberation based on the dhāraṇī mantra that accords with the truth unshared by ordinary beings.

source: །དེས་ནི་འདོད་པའི་འདོད་ཆགས་དང་གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་དང་། དབྱིབས་ཀྱི་འདོད་ཆགས་དང་། རེག་པའི་འདོད་ཆགས་དང་། རྣམ་པར་གྲོལ་བ་མ་ཡིན་པའི་རྩེ་བའི་འདོད་ཆགས་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ།
en: Through it, all forms of attachment related to the desire realm, as well as all attachment to form, shape, contact, and passionate frolicking, will be abandoned.

source: །འཕགས་པའི་གང་ཟག་རྣམས་ཀྱི་ནི་ལྷག་མ་མེད་པར་འགྱུར་རོ།
en: The attachments of noble beings will disappear without any remainder.

source: །སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་ནི་ཉམ་སྨད་པར་འགྱུར་ཏེ། རྐྱེན་གྱི་དབང་གིས་ཕྱིས་སྐྱེ་བར་འགྱུར་ཞིང་ངན་སོང་གི་རྒྱུར་འགྱུར་རོ།
en: Those of ordinary beings will be weakened, but later on they will be born through the power of circumstances, and this will cause them to be born within the lower realms.

source: །འདི་ནི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱིས་དོན་གླེང་གཞི་དང་བཅས་པ་རྒྱས་པ་དང་བཅས་པ་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་ང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོའི་ལག་ནས་བསྐུར་བ་མཐུ་ཆེ་བ། ཕན་ཡོན་ཆེ་བ་ཡིན་ནོ། །འདུས་པ་ཆེན་པོ་འདི་ངས་བཤད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་ཡིན་ནོ།
en: “This was the detailed discussion on the meaning of the dhāraṇī mantra that accords with the truth, that the thus-gone Campaka Color conferred upon me through the bodhisattva great being Quintessence of the Sun’s Energy. It is powerful and beneficial, and it bestows faith in the teachings I expound within this great assembly.

source: །འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པ་གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་དང་། ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་ཐམས་ཅད་དང་། ཕྲག་དོག་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པ།
en: It exhausts all forms of attachment related to the desire realm, the form realm, and the formless realm, as well as all forms of pride, special pride, overweening pride, and envy.

source: ཡོངས་སུ་ཚོལ་བ་ཐམས་ཅད་དང་། བརྣབ་སེམས་ཐམས་ཅད་དང་། རྒོད་པ་ཐམས་ཅད་དང་། མ་རིག་པ་ཐམས་ཅད་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་དང་། ཐེ་ཙོམ་དང་། ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པ་ཐམས་ཅད་དང་། རྟག་པར་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་། སྲོག་ཏུ་ལྟ་བ་དང་། གསོ་བར་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་ཐམས་ཅད་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོར་ལྟ་བ་ཐམས་ཅད་དང་། གཟུགས་སུ་ལྟ་བ་ཐམས་ཅད་ཅེས་བྱ་བ་ནས་རེག་པར་ལྟ་བ་ཐམས་ཅད་ཅེས་བྱ་བའི་བར་དང་། སྐྱེ་བར་ལྟ་བ་ཐམས་ཅད་དང་། འབྱུང་བ་ཆེན་པོར་ལྟ་བ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཐམས་ཅད་རྡུལ་མེད་པར་བྱེད་པའི་བར་དང་། བྱང་གྲོལ་གྱི་བདེ་བ་ཐམས་ཅད་སྟོན་པར་བྱེད་པ་ཡིན་ནོ།
en: It brings about understanding with respect to all forms of longing, covetousness, agitation, and ignorance, and with respect to the view of the transitory collection, doubts, the views that consider discipline and disciplined conduct to be supreme, the views of permanence and nihilism, and all the views related to sentient beings, living beings, souls, persons, creators, feeling subjects, forms, tactile objects, birth, and the great elements. [. . .] It completely purifies all the aggregates, the elements, and the sense sources, and it reveals all the happiness of emancipation.

source: །རིམ་པ་དེས་ནི་བདུད་རྣམས་ཚར་གཅོད་པར་བྱེད་པ། ཀླུ་རྣམས་ཕམ་པར་བྱེད་པ།
en: “That statement annihilates the māras and defeats the nāgas.

source: ལྷ་རྣམས་དགའ་བར་བྱེད་པ། གནོད་སྦྱིན་རྣམས་མགུ་བར་བྱེད་པ། ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བྱེད་པ། ནམ་མཁའ་ལྡིང་རྣམས་དངང་བར་བྱེད་པ། མི་འམ་ཅི་རྣམས་དད་པར་བྱེད་པ། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་སྐྲག་པར་བྱེད་པ།
en: It delights the gods, pleases the yakṣas, overcomes the asuras, frightens the garuḍas, causes the kinnaras to develop faith, and terrifies the mahoragas.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་འདུལ་བར་བྱེད་པ། རྒྱལ་རིགས་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པ། བྲམ་ཟེ་རྣམས་འཇུག་པར་བྱེད་པ། རྗེའུ་རིགས་རྣམས་དགའ་བར་བྱེད་པ། དམངས་རིགས་རྣམས་མཆོག་ཏུ་དགའ་བར་བྱེད་པ།
en: It subjugates the enemies, delights the members of the kṣatriya class, induces comprehension in the brāhmaṇas, pleases the vaiśyas, and delights the śūdras.

source: བུད་མེད་འདོད་ཆགས་དང་བྲལ་བར་བྱེད་པ། མང་དུ་ཐོས་པ་རྣམས་སྐྱོ་བར་བྱེད་པ། རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: It frees women from their desires, engenders weariness in the scholars, delights spiritual practitioners, and cures all diseases.

source: འཐབ་པ་དང་། ཐབ་མོ་དང་། མུ་གེ་དང་། ནད་དང་། དུས་མ་ཡིན་པའི་ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ཆུ་བོ་དང་། གྲང་བ་དང་། དྲོ་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། རྩུབ་པ་དང་། རོ་མེད་པ་དང་། རེག་པར་དཀའ་བའི་དངོས་པོ་རྣམས་རྣམ་པར་ཞི་བར་བྱེད་པ།
en: It pacifies quarrels, fights, famine, disease, unexpected hostile armies, and untimely winds, rains, floods, cold, warmth, snow, and heat waves, and it softens substances that are harsh, tasteless, and hard to touch.

source: ཆོས་ཀྱི་ཚུལ་འབར་བར་བྱེད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པ། སངས་རྒྱས་ཀྱི་བསྟན་པ་སྟོན་པར་བྱེད་པ།
en: It causes the Dharma way to blaze, it ensures that the lineage of the Three Jewels remains uninterrupted, and it reveals the teachings of the Buddha.

source: འཁོར་བར་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བྱེད་པ། ཟད་པ་ཤེས་པ་སྐྱེད་པར་བྱེད་པ། མི་སྐྱེ་བ་ཤེས་པ་རྟོགས་པར་བྱེད་པ། མ་རིག་པའི་ཕུང་པོ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ། སྡུག་བསྔལ་ཐམས་ཅད་འདོར་བར་བྱེད་པ་ཡིན་ཏེ།
en: It provides relief to those who are afraid of saṃsāra, generates the knowledge of exhaustion, causes one to realize the knowledge of the unborn, overcomes the aggregates associated with ignorance, and removes all suffering.

source: འདི་ནི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡིན་ནོ།
en: This is the acceptance that accords with the truth.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་དེར་ལྷ་དང་མི་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་ཐོབ་བོ།
en: As this teaching was being given, an innumerable and limitless number of gods and humans present in that place attained the eye of Dharma, which is immaculate, spotless, and free of affliction with regard to phenomena.

source: །དེའི་ཚེ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ཏོ། །དེའི་ཚེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ནི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་འདི་ཐོབ་པར་གྱུར་ཏོ།
en: At that time, the minds of nine billion six hundred million beings were liberated from their defilements with no further grasping, and eighty trillion beings attained the dhāraṇī mantra that accords with the truth.

source: །དེའི་ཚེ་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཕྱིར་མི་ལྡོག་པར་ཡང་གྱུར་ཏོ། །སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: An innumerable and limitless number of sentient beings gave rise to the mind set on unsurpassed and perfect awakening and achieved the level of nonregression, and thirty-two thousand of them reached the acceptance of the unborn nature of phenomena.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། གྲུལ་བུམ་དང་། ཤ་ཟ་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: All the gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, pretas, kumbhāṇḍas, piśācas, humans, and nonhumans exclaimed, “Excellent!
